## :warning: Terraform Plan succeeded(change detected)
work_directory: `terraform/common/sandbox/project-factory`
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.project_factory[0].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {
      + host_project    = "common-sandbox-shared-vpc"
      + id              = (known after apply)
      + service_project = (known after apply)
    }

  # module.project_factory[0].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + project    = "common-sandbox-shared-vpc"
      + region     = "asia-northeast1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "sandbox-subnet-01"
    }

  # module.project_factory[0].module.project-factory.google_compute_subnetwork_iam_member.service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + project    = "common-sandbox-shared-vpc"
      + region     = "asia-northeast1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "sandbox-subnet-01"
    }

  # module.project_factory[0].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01D78C-522BC7-53DC37"
      + effective_labels    = (known after apply)
      + folder_id           = "803424568685"
      + id                  = (known after apply)
      + name                = "sandbox-arairyus"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.project_factory[0].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project_factory[0].module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "sandbox-arairyus-iac"
      + disabled     = false
      + display_name = "sandbox-arairyus Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.project_factory[0].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project_factory[0].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.project_factory[0].module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iam.googleapis.com"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>